using System;
using System.Collections.Generic;

namespace ConsoleAppMorseCode
{
    class MorseCodeConverter
    {
        // Создание словаря с символами и их кодами Морзе (английские и русские буквы)
        private static Dictionary<char, string> morseCode = new Dictionary<char, string>()
    {
        {'A', ".-"}, {'B', "-..."}, {'C', "-.-."}, {'D', "-.."}, {'E', "."}, {'F', "..-."},
        {'G', "--."}, {'H', "...."}, {'I', ".."}, {'J', ".---"}, {'K', "-.-"}, {'L', ".-.."},
        {'M', "--"}, {'N', "-."}, {'O', "---"}, {'P', ".--."}, {'Q', "--.-"}, {'R', ".-."},
        {'S', "..."}, {'T', "-"}, {'U', "..-"}, {'V', "...-"}, {'W', ".--"}, {'X', "-..-"},
        {'Y', "-.--"}, {'Z', "--.."},
        {'А', ".-"}, {'Б', "-..."}, {'В', ".--"}, {'Г', "--."}, {'Д', "-.."}, {'Е', "."},
        {'Ё', "."}, {'Ж', "...-"}, {'З', "--.."}, {'И', ".."}, {'Й', ".---"}, {'К', "-.-"},
        {'Л', ".-.."}, {'М', "--"}, {'Н', "-."}, {'О', "---"}, {'П', ".--."}, {'Р', ".-."},
        {'С', "..."}, {'Т', "-"}, {'У', "..-"}, {'Ф', "..-."}, {'Х', "...."}, {'Ц', "-.-."},
        {'Ч', "---."}, {'Ш', "----"}, {'Щ', "--.-"}, {'Ъ', ".--.-."}, {'Ы', "-.--"},
        {'Ь', "-..-"}, {'Э', "..-.."}, {'Ю', "..--"}, {'Я', ".-.-"},
        {'0', "-----"}, {'1', ".----"}, {'2', "..---"}, {'3', "...--"}, {'4', "....-"},
        {'5', "....."}, {'6', "-...."}, {'7', "--..."}, {'8', "---.."}, {'9', "----."},
        {'.', ".-.-.-"}, {',', "--..--"}, {'?', "..--.."}, {'\'', ".----."}, {'!', "-.-.--"},
        {'/', "-..-."}, {'(', "-.--."}, {')', "-.--.-"}, {'&', ".-..."}, {':', "---..."},
        {';', "-.-.-."}, {'=', "-...-"}, {'+', ".-.-."}, {'-', "-....-"}, {'_', "..--.-"},
        {'"', ".-..-."}, {'$', "...-..-"}, {'@', ".--.-."}, {' ', "/"}
    };

        //Метод для перевода символов в код Морзе
        public static string TextToMorse(string text)
        {
            text = text.ToUpper();
            string morseText = "";

            foreach (char letter in text)
            {
                if (morseCode.ContainsKey(letter))
                {
                    morseText += morseCode[letter] + " ";
                }
                else
                {
                    morseText += letter + " ";
                }
            }

            return morseText;
        }


        static void Main()
        {
            Console.WriteLine("Введите текст для кодирования:");
            string inputText = Console.ReadLine();                  //Вводим текст
            string encodedText = TextToMorse(inputText);            //Переводим текст в код Морзе
            Console.WriteLine("Текст в азбуке Морзе:");
            Console.WriteLine(encodedText);                         //Выводим код Морзе
        }
    }
}
