Imports System

Module MorseCodeConverter

    'Алфавит для перевода символов в код Морзе'
    Dim MORSE_CODE_DICT As New Dictionary(Of Char, String) From {
        {"A", ".-"}, {"B", "-..."}, {"C", "-.-."}, {"D", "-.."}, {"E", "."}, {"F", "..-."}, {"G", "--."},
        {"H", "...."}, {"I", ".."}, {"J", ".---"}, {"K", "-.-"}, {"L", ".-.."}, {"M", "--"}, {"N", "-."},
        {"O", "---"}, {"P", ".--."}, {"Q", "--.-"}, {"R", ".-."}, {"S", "..."}, {"T", "-"}, {"U", "..-"},
        {"V", "...-"}, {"W", ".--"}, {"X", "-..-"}, {"Y", "-.--"}, {"Z", "--.."},
        {"А", ".-"}, {"Б", "-..."}, {"В", ".--"}, {"Г", "--."}, {"Д", "-.."}, {"Е", "."}, {"Ё", "."}, {"Ж", "...-"},
        {"З", "--.."}, {"И", ".."}, {"Й", ".---"}, {"К", "-.-"}, {"Л", ".-.."}, {"М", "--"}, {"Н", "-."},
        {"О", "---"}, {"П", ".--."}, {"Р", ".-."}, {"С", "..."}, {"Т", "-"}, {"У", "..-"}, {"Ф", "..-."},
        {"Х", "...."}, {"Ц", "-.-."}, {"Ч", "---."}, {"Ш", "----"}, {"Щ", "--.-"}, {"Ъ", ".--.-."},
        {"Ы", "-.--"}, {"Ь", "-..-"}, {"Э", "..-.."}, {"Ю", "..--"}, {"Я", ".-.-"}, {"0", "-----"},
        {"1", ".----"}, {"2", "..---"}, {"3", "...--"}, {"4", "....-"}, {"5", "....."}, {"6", "-...."},
        {"7", "--..."}, {"8", "---.."}, {"9", "----."}, {".", ".-.-.-"}, {",", "--..--"}, {"?", "..--.."},
        {"'", ".----."}, {"!", "-.-.--"}, {"/", "-..-."}, {"(", "-.--."}, {")", "-.--.-"}, {"&", ".-..."},
        {":", "---..."}, {";", "-.-.-."}, {"=", "-...-"}, {"+", ".-.-."}, {"-", "-....-"}, {"_", "..--.-"},
        {"""", ".-..-."}, {"$", "...-..-"}, {"@", ".--.-."}, {" ", "/"}
    }

    'Метод перевода символов в код Морзе'
    Function TextToMorse(text As String) As String
        Dim morseCode As String = ""
        For Each c As Char In text.ToUpper()
            If MORSE_CODE_DICT.ContainsKey(c) Then
                morseCode += MORSE_CODE_DICT(c) & " "
            Else
                morseCode += " "
            End If
        Next
        Return morseCode
    End Function

    Sub Main()
        Console.Write("Введите текст для кодирования: ")
        Dim text As String = Console.ReadLine()   'Вводим текс'
        Dim encodedText As String = TextToMorse(text)   'Переводим текст в код Морзе'
        Console.WriteLine($"Текст на азбуке Морзе: {encodedText}")   'Выводим код Морзе'
    End Sub
End Module

